## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 24 to add, 10 to change, 36 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| delete   | `aws_lambda_code_signing_config.lambda_code_signing_config[0]`                    |
|          | `aws_s3_object.audit_logs_archiver_code`                                          |
|          | `aws_s3_object.audit_logs_code`                                                   |
|          | `aws_s3_object.form_archiver_code`                                                |
|          | `aws_s3_object.nagware_code`                                                      |
|          | `aws_s3_object.reliability_code`                                                  |
|          | `aws_s3_object.reliability_dlq_consumer_code`                                     |
|          | `aws_s3_object.response_archiver_code`                                            |
|          | `aws_s3_object.submission_code`                                                   |
|          | `aws_s3_object.vault_integrity_code`                                              |
|          | `aws_signer_signing_job.vault_integrity[0]`                                       |
|          | `aws_signer_signing_profile.lambda_signing_profile[0]`                            |
| update   | `aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger`                  |
|          | `aws_cloudwatch_event_target.form_archiver_lambda_trigger`                        |
|          | `aws_cloudwatch_event_target.nagware_lambda_trigger`                              |
|          | `aws_cloudwatch_event_target.reliability_dlq_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.response_archiver_lambda_trigger`                    |
|          | `aws_iam_policy.lambda_s3`                                                        |
|          | `aws_lambda_event_source_mapping.audit_logs`                                      |
|          | `aws_lambda_event_source_mapping.reliability`                                     |
|          | `aws_lambda_event_source_mapping.reprocess_submission`                            |
|          | `aws_lambda_event_source_mapping.vault_updated_item_stream`                       |
| recreate | `aws_cloudwatch_log_group.archive_form_templates`                                 |
|          | `aws_cloudwatch_log_group.audit_logs`                                             |
|          | `aws_cloudwatch_log_group.audit_logs_archiver`                                    |
|          | `aws_cloudwatch_log_group.dead_letter_queue_consumer`                             |
|          | `aws_cloudwatch_log_group.nagware`                                                |
|          | `aws_cloudwatch_log_group.reliability`                                            |
|          | `aws_cloudwatch_log_group.response_archiver`                                      |
|          | `aws_cloudwatch_log_group.submission`                                             |
|          | `aws_cloudwatch_log_group.vault_integrity`                                        |
|          | `aws_lambda_function.audit_logs`                                                  |
|          | `aws_lambda_function.audit_logs_archiver`                                         |
|          | `aws_lambda_function.form_archiver`                                               |
|          | `aws_lambda_function.nagware`                                                     |
|          | `aws_lambda_function.reliability`                                                 |
|          | `aws_lambda_function.reliability_dlq_consumer`                                    |
|          | `aws_lambda_function.response_archiver`                                           |
|          | `aws_lambda_function.submission`                                                  |
|          | `aws_lambda_function.vault_integrity`                                             |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
|          | `aws_lambda_permission.audit_logs_archiver`                                       |
|          | `aws_lambda_permission.submission`                                                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/8806396269).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "audit_logs_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs_Archiver" -> (known after apply)
        id             = "audit-logs-archiver-lambda-trigger-terraform-20240220171402558600000001"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.form_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "form_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates" -> (known after apply)
        id             = "form-archiver-lambda-trigger-terraform-20240208183143516200000001"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.nagware_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "nagware_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware" -> (known after apply)
        id             = "nagware-lambda-trigger-terraform-20240208193325429400000001"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.reliability_dlq_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "reliability_dlq_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer" -> (known after apply)
        id             = "reliability-dlq-lambda-trigger-terraform-20240208183143528700000002"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.response_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "response_archiver_lambda_trigger" {
      ~ arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver" -> (known after apply)
        id             = "response-archiver-lambda-trigger-terraform-20240208183143574200000003"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.archive_form_templates must be replaced
-/+ resource "aws_cloudwatch_log_group" "archive_form_templates" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Archive_Form_Templates" -> (known after apply)
      ~ id                = "/aws/lambda/Archive_Form_Templates" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Archive_Form_Templates" -> "/aws/lambda/form-archiver" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.audit_logs must be replaced
-/+ resource "aws_cloudwatch_log_group" "audit_logs" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Audit_Logs" -> (known after apply)
      ~ id                = "/aws/lambda/Audit_Logs" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Audit_Logs" -> "/aws/lambda/audit-logs" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.audit_logs_archiver must be replaced
-/+ resource "aws_cloudwatch_log_group" "audit_logs_archiver" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Audit_Logs_Archiver" -> (known after apply)
      ~ id                = "/aws/lambda/Audit_Logs_Archiver" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Audit_Logs_Archiver" -> "/aws/lambda/audit-logs-archiver" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.dead_letter_queue_consumer must be replaced
-/+ resource "aws_cloudwatch_log_group" "dead_letter_queue_consumer" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Reliability_DLQ_Consumer" -> (known after apply)
      ~ id                = "/aws/lambda/Reliability_DLQ_Consumer" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Reliability_DLQ_Consumer" -> "/aws/lambda/reliability-dlq-consumer" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.nagware must be replaced
-/+ resource "aws_cloudwatch_log_group" "nagware" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Nagware" -> (known after apply)
      ~ id                = "/aws/lambda/Nagware" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Nagware" -> "/aws/lambda/nagware" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.reliability must be replaced
-/+ resource "aws_cloudwatch_log_group" "reliability" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Reliability" -> (known after apply)
      ~ id                = "/aws/lambda/Reliability" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Reliability" -> "/aws/lambda/reliability" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.response_archiver must be replaced
-/+ resource "aws_cloudwatch_log_group" "response_archiver" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Response_Archiver" -> (known after apply)
      ~ id                = "/aws/lambda/Response_Archiver" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Response_Archiver" -> "/aws/lambda/response-archiver" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.submission must be replaced
-/+ resource "aws_cloudwatch_log_group" "submission" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Submission" -> (known after apply)
      ~ id                = "/aws/lambda/Submission" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Submission" -> "/aws/lambda/submission" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.vault_integrity must be replaced
-/+ resource "aws_cloudwatch_log_group" "vault_integrity" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Vault_Data_Integrity_Check" -> (known after apply)
      ~ id                = "/aws/lambda/Vault_Data_Integrity_Check" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Vault_Data_Integrity_Check" -> "/aws/lambda/vault-integrity" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id          = "arn:aws:iam::687401027353:policy/lambda_s3"
        name        = "lambda_s3"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:s3:::forms-staging-reliability-file-storage",
                          - "arn:aws:s3:::forms-staging-lambda-code/*",
                          - "arn:aws:s3:::forms-staging-lambda-code",
                            "arn:aws:s3:::forms-staging-audit-logs-archive-storage/*",
                            # (3 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_code_signing_config.lambda_code_signing_config[0] will be destroyed
  # (because aws_lambda_code_signing_config.lambda_code_signing_config is not in configuration)
  - resource "aws_lambda_code_signing_config" "lambda_code_signing_config" {
      - arn           = "arn:aws:lambda:ca-central-1:687401027353:code-signing-config:csc-0e61d1a25a7a3956e" -> null
      - config_id     = "csc-0e61d1a25a7a3956e" -> null
      - id            = "arn:aws:lambda:ca-central-1:687401027353:code-signing-config:csc-0e61d1a25a7a3956e" -> null
      - last_modified = "2023-12-11T15:10:22.188857Z" -> null

      - allowed_publishers {
          - signing_profile_version_arns = [
              - "arn:aws:signer:ca-central-1:687401027353:/signing-profiles/lambda_signing_profile_20231207215659156300000001/3cak3nO7rT",
            ] -> null
        }

      - policies {
          - untrusted_artifact_on_deployment = "Enforce" -> null
        }
    }

  # aws_lambda_event_source_mapping.audit_logs will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "audit_logs" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs" -> (known after apply)
        id                                 = "bc90f6e4-30dc-4493-a000-2635f5db0fe9"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.reliability will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "reliability" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability" -> (known after apply)
        id                                 = "1f81bf31-9e9a-487e-8f53-cfd54d93316a"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.reprocess_submission will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability" -> (known after apply)
        id                                 = "e9bf5752-e38a-4dd8-9d2e-489597c00ef1"
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      ~ function_name                      = "arn:aws:lambda:ca-central-1:687401027353:function:Vault_Data_Integrity_Check" -> (known after apply)
        id                                 = "6bfeda18-4b6d-4a3d-b54b-bbdebb8aa98e"
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs must be replaced
-/+ resource "aws_lambda_function" "audit_logs" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs" -> (known after apply)
      ~ function_name                  = "Audit_Logs" -> "audit-logs" # forces replacement
      - handler                        = "audit_logs.handler" -> null
      ~ id                             = "Audit_Logs" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-15T13:46:13.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "audit_logs_code" -> null
      - s3_object_version              = "AUJ430SITKAR0SC.DpjsXdw0iP5ntwXp" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw=" -> (known after apply)
      ~ source_code_size               = 4114773 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver must be replaced
-/+ resource "aws_lambda_function" "audit_logs_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs_Archiver" -> (known after apply)
      ~ function_name                  = "Audit_Logs_Archiver" -> "audit-logs-archiver" # forces replacement
      - handler                        = "audit_logs_archiver.handler" -> null
      ~ id                             = "Audit_Logs_Archiver" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs_Archiver/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-20T17:14:02.647+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs_Archiver:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Audit_Logs_Archiver:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "audit_logs_archiver_code" -> null
      - s3_object_version              = "bMDQzYU6tawp4CUVqctMsk9nqAIirObZ" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI=" -> (known after apply)
      ~ source_code_size               = 4774980 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver must be replaced
-/+ resource "aws_lambda_function" "form_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates" -> (known after apply)
      ~ function_name                  = "Archive_Form_Templates" -> "form-archiver" # forces replacement
      - handler                        = "form_archiver.handler" -> null
      ~ id                             = "Archive_Form_Templates" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-09T19:02:51.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "form_archiver_code" -> null
      - s3_object_version              = "abRfM2DX7WwemV.SuTE_2Mc9eU0DrDkp" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "tZom8NvYkLTCiFBHAx0p97qloJ1ZcMMumoKxxhc4SWc=" -> (known after apply)
      ~ source_code_size               = 4485536 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware must be replaced
-/+ resource "aws_lambda_function" "nagware" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware" -> (known after apply)
      ~ function_name                  = "Nagware" -> "nagware" # forces replacement
      - handler                        = "nagware.handler" -> null
      ~ id                             = "Nagware" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Nagware/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-09T19:02:46.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Nagware:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "nagware_code" -> null
      - s3_object_version              = "KyCYYJA9Gs44WT7Ups8oU49qpGhxfW.k" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "ewsERJHdgUqXPuAunXW9Djvue3VCJbRmdbJySbEUXMY=" -> (known after apply)
      ~ source_code_size               = 10578943 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability must be replaced
-/+ resource "aws_lambda_function" "reliability" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability" -> (known after apply)
      ~ function_name                  = "Reliability" -> "reliability" # forces replacement
      - handler                        = "reliability.handler" -> null
      ~ id                             = "Reliability" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Reliability/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-22T14:01:41.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Reliability:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "reliability_code" -> null
      - s3_object_version              = "kTorjeerPtRM4w1pwNIig3.4D4YxE3JD" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "gyCSkTbBtROZbqEOQMsEWTd3X+JXF91xF4ufJrDBrys=" -> (known after apply)
      ~ source_code_size               = 11933697 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer must be replaced
-/+ resource "aws_lambda_function" "reliability_dlq_consumer" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer" -> (known after apply)
      ~ function_name                  = "Reliability_DLQ_Consumer" -> "reliability-dlq-consumer" # forces replacement
      - handler                        = "dead_letter_queue_consumer.handler" -> null
      ~ id                             = "Reliability_DLQ_Consumer" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-08T18:31:43.556+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "reliability_dlq_consumer_code" -> null
      - s3_object_version              = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> (known after apply)
      ~ source_code_size               = 4641394 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver must be replaced
-/+ resource "aws_lambda_function" "response_archiver" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver" -> (known after apply)
      ~ function_name                  = "Response_Archiver" -> "response-archiver" # forces replacement
      - handler                        = "response_archiver.handler" -> null
      ~ id                             = "Response_Archiver" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver/invocations" -> (known after apply)
      ~ last_modified                  = "2024-02-08T18:31:43.601+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "response_archiver_code" -> null
      - s3_object_version              = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> (known after apply)
      ~ source_code_size               = 5847434 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission must be replaced
-/+ resource "aws_lambda_function" "submission" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Submission" -> (known after apply)
      ~ function_name                  = "Submission" -> "submission" # forces replacement
      - handler                        = "submission.handler" -> null
      ~ id                             = "Submission" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Submission/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-15T13:46:14.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Submission:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Submission:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "submission_code" -> null
      - s3_object_version              = "MnDwZ.Kvqsf5nNQdD39DAXo1ypnCEJhj" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
